script1.org
* Scripts to import the CSV files into the database
** Create the database
    #+begin_src sql
   SHOW DATABASES;
    #+end_src
   
    Results:
    | Database           |
    |--------------------|
    | information_schema |
    | mysql              |
    | openflights        |
    | performance_schema |
   
    #+begin_src sql :results silent
   create database openflights
    #+end_src

    #+begin_src sql
    use openflights;
    show tables;
    #+end_src

    Results:
    | Tables_in_openflights |
    |-----------------------|
    | airlines              |
    | airports              |
    | countries             |
    | living_cost           |
    | planes                |
    | routes                |

** airports.csv
   Column format:
   | Airport ID            | Unique OpenFlights identifier for this airport.                                     |
   | Name                  | Name of airport. May or may not contain the City name.                              |
   | City                  | Main city served by airport. May be spelled differently from Name.                  |
   | Country               | Country or territory where airport is located. See Countries to cross-reference to ISO 3166-1 codes. |
   | IATA                  | 3-letter IATA code. Null if not assigned/unknown.                                   |
   | ICAO                  | 4-letter ICAO code. Null if not assigned.                                           |
   | Latitude              | Decimal degrees, usually to six significant digits. Negative is South, positive is North. |
   | Longitude             | Decimal degrees, usually to six significant digits. Negative is West, positive is East. |
   | Altitude              | In feet.                                                                            |
   | Timezone              | Hours offset from UTC. Fractional hours are expressed as decimals, eg. India is 5.5. |
   | DST                   | Daylight savings time. One of E (Europe), A (US/Canada), S (South America), O (Australia), Z (New Zealand), N (None) or U (Unknown). See also: Help: Time |
   | Tz database time zone | Timezone in "tz" (Olson) format, eg. "America/Los_Angeles".                         |
   | Type                  | Type of the airport. Value "airport" for air terminals, "station" for train stations, "port" for ferry terminals and "unknown" if not known. In airports.csv, only type=airport is included. |
   | Source                | Source of this data. "OurAirports" for data sourced from OurAirports, "Legacy" for old data not matched to OurAirports (mostly DAFIF), "User" for unverified user contributions. In airports.csv, only source=OurAirports is included. |
   
   #+begin_src sql :results silent
   use openflights;
   drop table airports;    	
   #+end_src
   
   #+begin_src sql :results silent
   use openflights;
   create table airports (
       id int not null auto_increment,
       name varchar(255) not null,
       city varchar(255) not null,
       country varchar(255) not null,
       iata varchar(10),                  
       icao varchar(10),                 
       latitude float(53),        
       longitude float(53),       
       altitude integer,              
       timezone decimal(5, 2),              
       dst varchar(3),                    
       tz varchar(255),
       type varchar(255),                 
       source varchar(255),
       primary key (id)
   );
   #+end_src
   
   #+begin_src sql
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/airports.csv'
   into table airports
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
   #+end_src

   #+begin_src sql
   use openflights;
   select * from airports where city='Anchorage';
   #+end_src
   
   Results:
   |   id | name                                        | city      | country       | iata | icao |           latitude |           longitude | altitude | timezone | dst | tz                | type    | source      |
   |------+---------------------------------------------+-----------+---------------+------+------+--------------------+---------------------+----------+----------+-----+-------------------+---------+-------------|
   | 3438 | Merrill Field                               | Anchorage | United States | MRI  | PAMR |   61.2135009765625 |   -149.843994140625 |      137 |    -9.00 | A   | America/Anchorage | airport | OurAirports |
   | 3692 | Elmendorf Air Force Base                    | Anchorage | United States | EDF  | PAED | 61.250999450683594 |  -149.8070068359375 |      212 |    -9.00 | A   | America/Anchorage | airport | OurAirports |
   | 3774 | Ted Stevens Anchorage International Airport | Anchorage | United States | ANC  | PANC | 61.174400329589844 | -149.99600219726562 |      152 |    -9.00 | A   | America/Anchorage | airport | OurAirports |
   | 8051 | Lake Hood Airport                           | Anchorage | United States | NULL | PALH |          61.186946 |         -149.965442 |       73 |    -9.00 | A   | America/Anchorage | airport | OurAirports |

