script1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-22 Sun 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Denis Davidoglu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org207c317">1. Scripts to import the CSV files into the database</a>
<ul>
<li><a href="#org009f557">1.1. Create the database</a></li>
<li><a href="#org9580895">1.2. airports.csv</a></li>
<li><a href="#org11fa249">1.3. airlines.csv</a></li>
<li><a href="#orgd188ba9">1.4. routes.csv</a></li>
<li><a href="#org153c020">1.5. countries.csv</a></li>
<li><a href="#orgfd2c976">1.6. planes.csv</a></li>
<li><a href="#org2b4cd65">1.7. cost_of_living_indices.csv</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org207c317" class="outline-2">
<h2 id="org207c317"><span class="section-number-2">1.</span> Scripts to import the CSV files into the database</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org009f557" class="outline-3">
<h3 id="org009f557"><span class="section-number-3">1.1.</span> Create the database</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sql">   SHOW DATABASES;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">information_schema</td>
</tr>

<tr>
<td class="org-left">mysql</td>
</tr>

<tr>
<td class="org-left">openflights</td>
</tr>

<tr>
<td class="org-left">performance_schema</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql">   create database openflights
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">    use openflights;
    show tables;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tables_in_openflights</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">airlines</td>
</tr>

<tr>
<td class="org-left">airports</td>
</tr>

<tr>
<td class="org-left">countries</td>
</tr>

<tr>
<td class="org-left">living_cost</td>
</tr>

<tr>
<td class="org-left">planes</td>
</tr>

<tr>
<td class="org-left">routes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9580895" class="outline-3">
<h3 id="org9580895"><span class="section-number-3">1.2.</span> airports.csv</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Column format:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Airport ID</td>
<td class="org-left">Unique OpenFlights identifier for this airport.</td>
</tr>

<tr>
<td class="org-left">Name</td>
<td class="org-left">Name of airport. May or may not contain the City name.</td>
</tr>

<tr>
<td class="org-left">City</td>
<td class="org-left">Main city served by airport. May be spelled differently from Name.</td>
</tr>

<tr>
<td class="org-left">Country</td>
<td class="org-left">Country or territory where airport is located. See Countries to cross-reference to ISO 3166-1 codes.</td>
</tr>

<tr>
<td class="org-left">IATA</td>
<td class="org-left">3-letter IATA code. Null if not assigned/unknown.</td>
</tr>

<tr>
<td class="org-left">ICAO</td>
<td class="org-left">4-letter ICAO code. Null if not assigned.</td>
</tr>

<tr>
<td class="org-left">Latitude</td>
<td class="org-left">Decimal degrees, usually to six significant digits. Negative is South, positive is North.</td>
</tr>

<tr>
<td class="org-left">Longitude</td>
<td class="org-left">Decimal degrees, usually to six significant digits. Negative is West, positive is East.</td>
</tr>

<tr>
<td class="org-left">Altitude</td>
<td class="org-left">In feet.</td>
</tr>

<tr>
<td class="org-left">Timezone</td>
<td class="org-left">Hours offset from UTC. Fractional hours are expressed as decimals, eg. India is 5.5.</td>
</tr>

<tr>
<td class="org-left">DST</td>
<td class="org-left">Daylight savings time. One of E (Europe), A (US/Canada), S (South America), O (Australia), Z (New Zealand), N (None) or U (Unknown). See also: Help: Time</td>
</tr>

<tr>
<td class="org-left">Tz database time zone</td>
<td class="org-left">Timezone in "tz" (Olson) format, eg. "America/Los_Angeles".</td>
</tr>

<tr>
<td class="org-left">Type</td>
<td class="org-left">Type of the airport. Value "airport" for air terminals, "station" for train stations, "port" for ferry terminals and "unknown" if not known. In airports.csv, only type=airport is included.</td>
</tr>

<tr>
<td class="org-left">Source</td>
<td class="org-left">Source of this data. "OurAirports" for data sourced from OurAirports, "Legacy" for old data not matched to OurAirports (mostly DAFIF), "User" for unverified user contributions. In airports.csv, only source=OurAirports is included.</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   drop table airports;    	
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   create table airports (
       id int not null auto_increment,
       name varchar(255) not null,
       city varchar(255) not null,
       country varchar(255) not null,
       iata varchar(10),                  
       icao varchar(10),                 
       latitude float(53),        
       longitude float(53),       
       altitude integer,              
       timezone decimal(5, 2),              
       dst varchar(3),                    
       tz varchar(255),
       type varchar(255),                 
       source varchar(255),
       primary key (id)
   );
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   show tables;
   load data infile '/var/lib/mysql/airports.csv'
   into table airports
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   select * from airports where city='Anchorage';
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">id</th>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">city</th>
<th scope="col" class="org-left">country</th>
<th scope="col" class="org-left">iata</th>
<th scope="col" class="org-left">icao</th>
<th scope="col" class="org-right">latitude</th>
<th scope="col" class="org-right">longitude</th>
<th scope="col" class="org-right">altitude</th>
<th scope="col" class="org-right">timezone</th>
<th scope="col" class="org-left">dst</th>
<th scope="col" class="org-left">tz</th>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3438</td>
<td class="org-left">Merrill Field</td>
<td class="org-left">Anchorage</td>
<td class="org-left">United States</td>
<td class="org-left">MRI</td>
<td class="org-left">PAMR</td>
<td class="org-right">61.2135009765625</td>
<td class="org-right">-149.843994140625</td>
<td class="org-right">137</td>
<td class="org-right">-9.00</td>
<td class="org-left">A</td>
<td class="org-left">America/Anchorage</td>
<td class="org-left">airport</td>
<td class="org-left">OurAirports</td>
</tr>

<tr>
<td class="org-right">3692</td>
<td class="org-left">Elmendorf Air Force Base</td>
<td class="org-left">Anchorage</td>
<td class="org-left">United States</td>
<td class="org-left">EDF</td>
<td class="org-left">PAED</td>
<td class="org-right">61.250999450683594</td>
<td class="org-right">-149.8070068359375</td>
<td class="org-right">212</td>
<td class="org-right">-9.00</td>
<td class="org-left">A</td>
<td class="org-left">America/Anchorage</td>
<td class="org-left">airport</td>
<td class="org-left">OurAirports</td>
</tr>

<tr>
<td class="org-right">3774</td>
<td class="org-left">Ted Stevens Anchorage International Airport</td>
<td class="org-left">Anchorage</td>
<td class="org-left">United States</td>
<td class="org-left">ANC</td>
<td class="org-left">PANC</td>
<td class="org-right">61.174400329589844</td>
<td class="org-right">-149.99600219726562</td>
<td class="org-right">152</td>
<td class="org-right">-9.00</td>
<td class="org-left">A</td>
<td class="org-left">America/Anchorage</td>
<td class="org-left">airport</td>
<td class="org-left">OurAirports</td>
</tr>

<tr>
<td class="org-right">8051</td>
<td class="org-left">Lake Hood Airport</td>
<td class="org-left">Anchorage</td>
<td class="org-left">United States</td>
<td class="org-left">NULL</td>
<td class="org-left">PALH</td>
<td class="org-right">61.186946</td>
<td class="org-right">-149.965442</td>
<td class="org-right">73</td>
<td class="org-right">-9.00</td>
<td class="org-left">A</td>
<td class="org-left">America/Anchorage</td>
<td class="org-left">airport</td>
<td class="org-left">OurAirports</td>
</tr>
</tbody>
</table>
</div>
</div>
