script1.org
** airlines.csv
   Column format:
   | Airline ID | Unique OpenFlights identifier for this airline.                                      |
   | Name       | Name of the airline.                                                                 |
   | Alias      | Alias of the airline. For example, All Nippon Airways is commonly known as "ANA".    |
   | IATA       | 2-letter IATA code, if available.                                                    |
   | ICAO       | 3-letter ICAO code, if available.                                                    |
   | Callsign   | Airline callsign.                                                                    |
   | Country    | Country or territory where airport is located. See Countries to cross-reference to ISO 3166-1 codes. |
   | Active     | "Y" if the airline is or has until recently been operational, "N" if it is defunct. This field is not reliable: in particular, major airlines that stopped flying long ago, but have not had their IATA code reassigned (eg. Ansett/AN), will incorrectly show as "Y". |

   #+begin_src sql :results silent
   use openflights;
   drop table airlines;    	
   #+end_src

   #+begin_src sql :results silent
   use openflights;
   create table airlines (
       id int not null auto_increment,
       name varchar(255) not null,
       alias varchar(128),
       iata varchar(10),     
       icao varchar(10),          
       callsign varchar(255),
       country varchar(255),  
       active varchar(10),
       primary key (id)   
   );
   #+end_src
   
   #+begin_src sql
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/airlines.csv'
   into table airlines
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
   #+end_src

   #+begin_src sql
   use openflights;
   select * from airlines limit 10;
   #+end_src

   Results:
   | id | name                                         | alias | iata | icao | callsign       | country        | active |
   |----+----------------------------------------------+-------+------+------+----------------+----------------+--------|
   | -1 | Unknown                                      | NULL  | -    | N/A  | NULL           | NULL           | Y      |
   |  1 | Private flight                               | NULL  | -    | N/A  |                |                | Y      |
   |  2 | 135 Airways                                  | NULL  |      | GNL  | GENERAL        | United States  | N      |
   |  3 | 1Time Airline                                | NULL  | 1T   | RNX  | NEXTIME        | South Africa   | Y      |
   |  4 | 2 Sqn No 1 Elementary Flying Training School | NULL  |      | WYT  |                | United Kingdom | N      |
   |  5 | 213 Flight Unit                              | NULL  |      | TFU  |                | Russia         | N      |
   |  6 | 223 Flight Unit State Airline                | NULL  |      | CHD  | CHKALOVSK-AVIA | Russia         | N      |
   |  7 | 224th Flight Unit                            | NULL  |      | TTF  | CARGO UNIT     | Russia         | N      |
   |  8 | 247 Jet Ltd                                  | NULL  |      | TWF  | CLOUD RUNNER   | United Kingdom | N      |
   |  9 | 3D Aviation                                  | NULL  |      | SEC  | SECUREX        | United States  | N      |

