script1.html

<div id="outline-container-org11fa249" class="outline-3">
<h3 id="org11fa249"><span class="section-number-3">1.3.</span> airlines.csv</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Column format:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Airline ID</td>
<td class="org-left">Unique OpenFlights identifier for this airline.</td>
</tr>

<tr>
<td class="org-left">Name</td>
<td class="org-left">Name of the airline.</td>
</tr>

<tr>
<td class="org-left">Alias</td>
<td class="org-left">Alias of the airline. For example, All Nippon Airways is commonly known as "ANA".</td>
</tr>

<tr>
<td class="org-left">IATA</td>
<td class="org-left">2-letter IATA code, if available.</td>
</tr>

<tr>
<td class="org-left">ICAO</td>
<td class="org-left">3-letter ICAO code, if available.</td>
</tr>

<tr>
<td class="org-left">Callsign</td>
<td class="org-left">Airline callsign.</td>
</tr>

<tr>
<td class="org-left">Country</td>
<td class="org-left">Country or territory where airport is located. See Countries to cross-reference to ISO 3166-1 codes.</td>
</tr>

<tr>
<td class="org-left">Active</td>
<td class="org-left">"Y" if the airline is or has until recently been operational, "N" if it is defunct. This field is not reliable: in particular, major airlines that stopped flying long ago, but have not had their IATA code reassigned (eg. Ansett/AN), will incorrectly show as "Y".</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   drop table airlines;    	
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   create table airlines (
       id int not null auto_increment,
       name varchar(255) not null,
       alias varchar(128),
       iata varchar(10),     
       icao varchar(10),          
       callsign varchar(255),
       country varchar(255),  
       active varchar(10),
       primary key (id)   
   );
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   show tables;
   load data infile '/var/lib/mysql/airlines.csv'
   into table airlines
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   select * from airlines limit 10;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">id</th>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">alias</th>
<th scope="col" class="org-left">iata</th>
<th scope="col" class="org-left">icao</th>
<th scope="col" class="org-left">callsign</th>
<th scope="col" class="org-left">country</th>
<th scope="col" class="org-left">active</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">-1</td>
<td class="org-left">Unknown</td>
<td class="org-left">NULL</td>
<td class="org-left">-</td>
<td class="org-left">N/A</td>
<td class="org-left">NULL</td>
<td class="org-left">NULL</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Private flight</td>
<td class="org-left">NULL</td>
<td class="org-left">-</td>
<td class="org-left">N/A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">135 Airways</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GNL</td>
<td class="org-left">GENERAL</td>
<td class="org-left">United States</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">1Time Airline</td>
<td class="org-left">NULL</td>
<td class="org-left">1T</td>
<td class="org-left">RNX</td>
<td class="org-left">NEXTIME</td>
<td class="org-left">South Africa</td>
<td class="org-left">Y</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">2 Sqn No 1 Elementary Flying Training School</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">WYT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">United Kingdom</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">213 Flight Unit</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TFU</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Russia</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">223 Flight Unit State Airline</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">CHD</td>
<td class="org-left">CHKALOVSK-AVIA</td>
<td class="org-left">Russia</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">224th Flight Unit</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TTF</td>
<td class="org-left">CARGO UNIT</td>
<td class="org-left">Russia</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">247 Jet Ltd</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TWF</td>
<td class="org-left">CLOUD RUNNER</td>
<td class="org-left">United Kingdom</td>
<td class="org-left">N</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">3D Aviation</td>
<td class="org-left">NULL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SEC</td>
<td class="org-left">SECUREX</td>
<td class="org-left">United States</td>
<td class="org-left">N</td>
</tr>
</tbody>
</table>
</div>
</div>
