script1.org
** routes.csv
   Column format:
   | Airline                | 2-letter (IATA) or 3-letter (ICAO) code of the airline.                             |
   | Airline ID             | Unique OpenFlights identifier for airline (see Airline).                            |
   | Source airport         | 3-letter (IATA) or 4-letter (ICAO) code of the source airport.                      |
   | Source airport ID      | Unique OpenFlights identifier for source airport (see Airport)                      |
   | Destination airport    | 3-letter (IATA) or 4-letter (ICAO) code of the destination airport.                 |
   | Destination airport ID | Unique OpenFlights identifier for destination airport (see Airport)                 |
   | Codeshare              | "Y" if this flight is a codeshare (that is, not operated by Airline, but another carrier), empty otherwise. |
   | Stops                  | Number of stops on this flight ("0" for direct)                                     |
   | Equipment              | 3-letter codes for plane type(s) generally used on this flight, separated by spaces |

   #+begin_src sql :results silent
   use openflights;
   drop table routes;    	
   #+end_src

   #+begin_src sql :results silent
   use openflights;
   create table routes (
       airline_name varchar(10) not null,    	  
       airline_id int not null,
       src_airport varchar(10) not null,         
       src_airport_id int not null,
       dest_airport varchar(10) not null,
       dest_airport_id int not null,
       codeshare varchar(10),
       stops int,                   
       equipment varchar(128),             
       foreign key (airline_id)
           references airlines(id),
       foreign key (src_airport_id)
           references airports(id),
       foreign key (dest_airport_id)
           references airports(id)
   );
   #+end_src

   #+begin_src sql
   set foreign_key_checks=0;
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/routes.csv'
   into table routes
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
   #+end_src

   #+begin_src sql
   use openflights;
   select * from routes limit 10 offset 100;
   #+end_src

   Results:
   | airline_name | airline_id | src_airport | src_airport_id | dest_airport | dest_airport_id | codeshare | stops | equipment |
   |--------------+------------+-------------+----------------+--------------+-----------------+-----------+-------+-----------|
   | 2K           |       1338 | BOG         |           2709 | UIO          |            2688 |           |     0 | 319 320 |
   | 2K           |       1338 | CLO         |           2715 | GYE          |            2673 |           |     0 | 319     |
   | 2K           |       1338 | GYE         |           2673 | BOG          |            2709 |           |     0 | 319     |
   | 2K           |       1338 | GYE         |           2673 | CLO          |            2715 |           |     0 | 319     |
   | 2K           |       1338 | GYE         |           2673 | SCY          |            6045 |           |     0 | 319 320 |
   | 2K           |       1338 | GYE         |           2673 | UIO          |            2688 |           |     0 | 320 319 |
   | 2K           |       1338 | OCC         |           2670 | UIO          |            2688 |           |     0 | 319     |
   | 2K           |       1338 | SCY         |           6045 | GYE          |            2673 |           |     0 | 319 320 |
   | 2K           |       1338 | UIO         |           2688 | BOG          |            2709 |           |     0 | 319 320 |
   | 2K           |       1338 | UIO         |           2688 | GYE          |            2673 |           |     0 | 319     |
   
** countries.csv
   Column format:
   | name       | Full name of the country or territory.                                              |
   | iso_code   | Unique two-letter ISO 3166-1 code for the country or territory.                     |
   | dafif_code | FIPS country codes as used in DAFIF. Obsolete and primarily of historical interested. |

   #+begin_src sql :results silent
   use openflights;
   drop table countries;
   #+end_src
   
   #+begin_src sql :results silent
   use openflights;
   create table countries (
       name varchar(255),
       iso_code varchar(10),
       dafif_code varchar(10),
       primary key (name)
   );	
   #+end_src

   #+begin_src sql :results silent
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/countries.csv'
   into table countries
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
   #+end_src

   #+begin_src sql
   use openflights;
   select * from countries limit 10;
   #+end_src

   Results:
   | name                | iso_code | dafif_code |
   |---------------------+----------+------------|
   | Afghanistan         | AF       | AF         |
   | Albania             | AL       | AL         |
   | Algeria             | DZ       | AG         |
   | American Samoa      | AS       | AQ         |
   | Angola              | AO       | AO         |
   | Anguilla            | AI       | AV         |
   | Antarctica          | AQ       | AY         |
   | Antigua and Barbuda | AG       | AC         |
   | Argentina           | AR       | AR         |
   | Armenia             | AM       | AM         |
   
