script1.html

<div id="outline-container-orgd188ba9" class="outline-3">
<h3 id="orgd188ba9"><span class="section-number-3">1.4.</span> routes.csv</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Column format:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Airline</td>
<td class="org-left">2-letter (IATA) or 3-letter (ICAO) code of the airline.</td>
</tr>

<tr>
<td class="org-left">Airline ID</td>
<td class="org-left">Unique OpenFlights identifier for airline (see Airline).</td>
</tr>

<tr>
<td class="org-left">Source airport</td>
<td class="org-left">3-letter (IATA) or 4-letter (ICAO) code of the source airport.</td>
</tr>

<tr>
<td class="org-left">Source airport ID</td>
<td class="org-left">Unique OpenFlights identifier for source airport (see Airport)</td>
</tr>

<tr>
<td class="org-left">Destination airport</td>
<td class="org-left">3-letter (IATA) or 4-letter (ICAO) code of the destination airport.</td>
</tr>

<tr>
<td class="org-left">Destination airport ID</td>
<td class="org-left">Unique OpenFlights identifier for destination airport (see Airport)</td>
</tr>

<tr>
<td class="org-left">Codeshare</td>
<td class="org-left">"Y" if this flight is a codeshare (that is, not operated by Airline, but another carrier), empty otherwise.</td>
</tr>

<tr>
<td class="org-left">Stops</td>
<td class="org-left">Number of stops on this flight ("0" for direct)</td>
</tr>

<tr>
<td class="org-left">Equipment</td>
<td class="org-left">3-letter codes for plane type(s) generally used on this flight, separated by spaces</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   drop table routes;    	
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   create table routes (
       airline_name varchar(10) not null,    	  
       airline_id int not null,
       src_airport varchar(10) not null,         
       src_airport_id int not null,
       dest_airport varchar(10) not null,
       dest_airport_id int not null,
       codeshare varchar(10),
       stops int,                   
       equipment varchar(128),             
       foreign key (airline_id)
           references airlines(id),
       foreign key (src_airport_id)
           references airports(id),
       foreign key (dest_airport_id)
           references airports(id)
   );
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   set foreign_key_checks=0;
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/routes.csv'
   into table routes
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   select * from routes limit 10 offset 100;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">airline_name</th>
<th scope="col" class="org-right">airline_id</th>
<th scope="col" class="org-left">src_airport</th>
<th scope="col" class="org-right">src_airport_id</th>
<th scope="col" class="org-left">dest_airport</th>
<th scope="col" class="org-right">dest_airport_id</th>
<th scope="col" class="org-left">codeshare</th>
<th scope="col" class="org-right">stops</th>
<th scope="col" class="org-left">equipment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">BOG</td>
<td class="org-right">2709</td>
<td class="org-left">UIO</td>
<td class="org-right">2688</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319 320</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">CLO</td>
<td class="org-right">2715</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">BOG</td>
<td class="org-right">2709</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">CLO</td>
<td class="org-right">2715</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">SCY</td>
<td class="org-right">6045</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319 320</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">UIO</td>
<td class="org-right">2688</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">320 319</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">OCC</td>
<td class="org-right">2670</td>
<td class="org-left">UIO</td>
<td class="org-right">2688</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">SCY</td>
<td class="org-right">6045</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319 320</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">UIO</td>
<td class="org-right">2688</td>
<td class="org-left">BOG</td>
<td class="org-right">2709</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319 320</td>
</tr>

<tr>
<td class="org-left">2K</td>
<td class="org-right">1338</td>
<td class="org-left">UIO</td>
<td class="org-right">2688</td>
<td class="org-left">GYE</td>
<td class="org-right">2673</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0</td>
<td class="org-left">319</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org153c020" class="outline-3">
<h3 id="org153c020"><span class="section-number-3">1.5.</span> countries.csv</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Column format:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">Full name of the country or territory.</td>
</tr>

<tr>
<td class="org-left">iso_code</td>
<td class="org-left">Unique two-letter ISO 3166-1 code for the country or territory.</td>
</tr>

<tr>
<td class="org-left">dafif_code</td>
<td class="org-left">FIPS country codes as used in DAFIF. Obsolete and primarily of historical interested.</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   drop table countries;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   create table countries (
       name varchar(255),
       iso_code varchar(10),
       dafif_code varchar(10),
       primary key (name)
   );	
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   show tables;
   load data infile '/var/lib/mysql/countries.csv'
   into table countries
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   select * from countries limit 10;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">iso_code</th>
<th scope="col" class="org-left">dafif_code</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Afghanistan</td>
<td class="org-left">AF</td>
<td class="org-left">AF</td>
</tr>

<tr>
<td class="org-left">Albania</td>
<td class="org-left">AL</td>
<td class="org-left">AL</td>
</tr>

<tr>
<td class="org-left">Algeria</td>
<td class="org-left">DZ</td>
<td class="org-left">AG</td>
</tr>

<tr>
<td class="org-left">American Samoa</td>
<td class="org-left">AS</td>
<td class="org-left">AQ</td>
</tr>

<tr>
<td class="org-left">Angola</td>
<td class="org-left">AO</td>
<td class="org-left">AO</td>
</tr>

<tr>
<td class="org-left">Anguilla</td>
<td class="org-left">AI</td>
<td class="org-left">AV</td>
</tr>

<tr>
<td class="org-left">Antarctica</td>
<td class="org-left">AQ</td>
<td class="org-left">AY</td>
</tr>

<tr>
<td class="org-left">Antigua and Barbuda</td>
<td class="org-left">AG</td>
<td class="org-left">AC</td>
</tr>

<tr>
<td class="org-left">Argentina</td>
<td class="org-left">AR</td>
<td class="org-left">AR</td>
</tr>

<tr>
<td class="org-left">Armenia</td>
<td class="org-left">AM</td>
<td class="org-left">AM</td>
</tr>
</tbody>
</table>
</div>
</div>
