script1.org
** planes.csv
   Column format:
   | Name      | Full name of the aircraft.                            |
   | IATA code | Unique three-letter IATA identifier for the aircraft. |
   | ICAO code | Unique four-letter ICAO identifier for the aircraft.  |

   #+begin_src sql :results silent
   use openflights;
   drop table planes;
   #+end_src
   
   #+begin_src sql :results silent
   use openflights;
   create table planes (
       name varchar(255),
       iata varchar(10),
       icao varchar(10),
       primary key (name)
   );	
   #+end_src

   #+begin_src sql :results silent
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/planes.csv'
   into table planes
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
   #+end_src

   #+begin_src sql
   use openflights;
   select * from planes limit 10;
   #+end_src

   Results:
   | name                                         | iata | icao |
   |----------------------------------------------+------+------|
   | Aerospatiale (Nord) 262                      | ND2  | N262 |
   | Aerospatiale (Sud Aviation) Se.210 Caravelle | CRV  | S210 |
   | Aerospatiale SN.601 Corvette                 | NDC  | S601 |
   | Aerospatiale/Alenia ATR 42-300               | AT4  | AT43 |
   | Aerospatiale/Alenia ATR 42-500               | AT5  | AT45 |
   | Aerospatiale/Alenia ATR 42-600               | ATR  | AT46 |
   | Aerospatiale/Alenia ATR 72                   | AT7  | AT72 |
   | Airbus A300                                  | AB3  | A30B |
   | Airbus A300-600                              | AB6  | A306 |
   | Airbus A300-600ST Super Transporter / Beluga | ABB  | A3ST |
   
** cost_of_living_indices.csv
   #+begin_src sql :results silent
   use openflights;
   drop table living_cost;
   #+end_src
   
   #+begin_src sql :results silent
   use openflights;
   create table living_cost (
       city varchar(255) not null,
       country varchar(255) not null,
       slug varchar(128),
       currency varchar(10),
       avg_index decimal(5, 2),
       rent_index decimal(5, 2),
       groceries_index decimal(5, 2),
       restaurant_index decimal(5, 2),
       purchasing_index decimal(5, 2)
    );	
   #+end_src

   #+begin_src sql :results silent
   use openflights;
   show tables;
   load data infile '/var/lib/mysql/cost_of_living_indices.csv'
   into table living_cost
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
   #+end_src

   #+begin_src sql
   use openflights;
   select * from living_cost limit 10;
   #+end_src

   Results:
   | city      | country     | slug     | currency | avg_index | rent_index | groceries_index | restaurant_index | purchasing_index |
   |-----------+-------------+----------+----------+-----------+------------+-----------------+------------------+------------------|
   | Hamilton  | Bermuda     |          | BMD      |    128.19 |     113.35 |          131.79 |           151.38 |            96.54 |
   | Geneva    | Switzerland | geneva   | CHF      |    103.02 |      70.66 |          129.84 |           131.70 |           121.11 |
   | Basel     | Switzerland |          | CHF      |     92.50 |      51.14 |          135.74 |           120.52 |           102.20 |
   | Zurich    | Switzerland | zurich   | CHF      |     98.72 |      64.69 |          131.73 |           131.71 |           134.50 |
   | Zug       | Switzerland |          | CHF      |     96.13 |      66.03 |          126.15 |           118.38 |            96.22 |
   | Lausanne  | Switzerland | Lausanne | CHF      |     87.60 |      54.82 |          115.00 |           119.34 |           117.56 |
   | Bern      | Switzerland | bern     | CHF      |     82.75 |      45.14 |          116.79 |           113.61 |           100.69 |
   | Lugano    | Switzerland |          | CHF      |     84.54 |      51.44 |          104.96 |           121.17 |            92.46 |
   | Stavanger | Norway      |          | NOK      |     76.08 |      36.73 |          102.26 |           134.69 |           111.35 |
   | Trondheim | Norway      |          | NOK      |     78.10 |      41.60 |          102.06 |           118.57 |            98.92 |

