script1.html

<div id="outline-container-orgfd2c976" class="outline-3">
<h3 id="orgfd2c976"><span class="section-number-3">1.6.</span> planes.csv</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Column format:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left">Full name of the aircraft.</td>
</tr>

<tr>
<td class="org-left">IATA code</td>
<td class="org-left">Unique three-letter IATA identifier for the aircraft.</td>
</tr>

<tr>
<td class="org-left">ICAO code</td>
<td class="org-left">Unique four-letter ICAO identifier for the aircraft.</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   drop table planes;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   create table planes (
       name varchar(255),
       iata varchar(10),
       icao varchar(10),
       primary key (name)
   );	
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   show tables;
   load data infile '/var/lib/mysql/planes.csv'
   into table planes
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   select * from planes limit 10;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">iata</th>
<th scope="col" class="org-left">icao</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Aerospatiale (Nord) 262</td>
<td class="org-left">ND2</td>
<td class="org-left">N262</td>
</tr>

<tr>
<td class="org-left">Aerospatiale (Sud Aviation) Se.210 Caravelle</td>
<td class="org-left">CRV</td>
<td class="org-left">S210</td>
</tr>

<tr>
<td class="org-left">Aerospatiale SN.601 Corvette</td>
<td class="org-left">NDC</td>
<td class="org-left">S601</td>
</tr>

<tr>
<td class="org-left">Aerospatiale/Alenia ATR 42-300</td>
<td class="org-left">AT4</td>
<td class="org-left">AT43</td>
</tr>

<tr>
<td class="org-left">Aerospatiale/Alenia ATR 42-500</td>
<td class="org-left">AT5</td>
<td class="org-left">AT45</td>
</tr>

<tr>
<td class="org-left">Aerospatiale/Alenia ATR 42-600</td>
<td class="org-left">ATR</td>
<td class="org-left">AT46</td>
</tr>

<tr>
<td class="org-left">Aerospatiale/Alenia ATR 72</td>
<td class="org-left">AT7</td>
<td class="org-left">AT72</td>
</tr>

<tr>
<td class="org-left">Airbus A300</td>
<td class="org-left">AB3</td>
<td class="org-left">A30B</td>
</tr>

<tr>
<td class="org-left">Airbus A300-600</td>
<td class="org-left">AB6</td>
<td class="org-left">A306</td>
</tr>

<tr>
<td class="org-left">Airbus A300-600ST Super Transporter / Beluga</td>
<td class="org-left">ABB</td>
<td class="org-left">A3ST</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2b4cd65" class="outline-3">
<h3 id="org2b4cd65"><span class="section-number-3">1.7.</span> cost_of_living_indices.csv</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   drop table living_cost;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   create table living_cost (
       city varchar(255) not null,
       country varchar(255) not null,
       slug varchar(128),
       currency varchar(10),
       avg_index decimal(5, 2),
       rent_index decimal(5, 2),
       groceries_index decimal(5, 2),
       restaurant_index decimal(5, 2),
       purchasing_index decimal(5, 2)
    );	
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   show tables;
   load data infile '/var/lib/mysql/cost_of_living_indices.csv'
   into table living_cost
   fields terminated by ','
   enclosed by '"'       
   lines terminated by '\n';
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">   use openflights;
   select * from living_cost limit 10;
</pre>
</div>

<p>
Results:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">city</th>
<th scope="col" class="org-left">country</th>
<th scope="col" class="org-left">slug</th>
<th scope="col" class="org-left">currency</th>
<th scope="col" class="org-right">avg_index</th>
<th scope="col" class="org-right">rent_index</th>
<th scope="col" class="org-right">groceries_index</th>
<th scope="col" class="org-right">restaurant_index</th>
<th scope="col" class="org-right">purchasing_index</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Hamilton</td>
<td class="org-left">Bermuda</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">BMD</td>
<td class="org-right">128.19</td>
<td class="org-right">113.35</td>
<td class="org-right">131.79</td>
<td class="org-right">151.38</td>
<td class="org-right">96.54</td>
</tr>

<tr>
<td class="org-left">Geneva</td>
<td class="org-left">Switzerland</td>
<td class="org-left">geneva</td>
<td class="org-left">CHF</td>
<td class="org-right">103.02</td>
<td class="org-right">70.66</td>
<td class="org-right">129.84</td>
<td class="org-right">131.70</td>
<td class="org-right">121.11</td>
</tr>

<tr>
<td class="org-left">Basel</td>
<td class="org-left">Switzerland</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">CHF</td>
<td class="org-right">92.50</td>
<td class="org-right">51.14</td>
<td class="org-right">135.74</td>
<td class="org-right">120.52</td>
<td class="org-right">102.20</td>
</tr>

<tr>
<td class="org-left">Zurich</td>
<td class="org-left">Switzerland</td>
<td class="org-left">zurich</td>
<td class="org-left">CHF</td>
<td class="org-right">98.72</td>
<td class="org-right">64.69</td>
<td class="org-right">131.73</td>
<td class="org-right">131.71</td>
<td class="org-right">134.50</td>
</tr>

<tr>
<td class="org-left">Zug</td>
<td class="org-left">Switzerland</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">CHF</td>
<td class="org-right">96.13</td>
<td class="org-right">66.03</td>
<td class="org-right">126.15</td>
<td class="org-right">118.38</td>
<td class="org-right">96.22</td>
</tr>

<tr>
<td class="org-left">Lausanne</td>
<td class="org-left">Switzerland</td>
<td class="org-left">Lausanne</td>
<td class="org-left">CHF</td>
<td class="org-right">87.60</td>
<td class="org-right">54.82</td>
<td class="org-right">115.00</td>
<td class="org-right">119.34</td>
<td class="org-right">117.56</td>
</tr>

<tr>
<td class="org-left">Bern</td>
<td class="org-left">Switzerland</td>
<td class="org-left">bern</td>
<td class="org-left">CHF</td>
<td class="org-right">82.75</td>
<td class="org-right">45.14</td>
<td class="org-right">116.79</td>
<td class="org-right">113.61</td>
<td class="org-right">100.69</td>
</tr>

<tr>
<td class="org-left">Lugano</td>
<td class="org-left">Switzerland</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">CHF</td>
<td class="org-right">84.54</td>
<td class="org-right">51.44</td>
<td class="org-right">104.96</td>
<td class="org-right">121.17</td>
<td class="org-right">92.46</td>
</tr>

<tr>
<td class="org-left">Stavanger</td>
<td class="org-left">Norway</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">NOK</td>
<td class="org-right">76.08</td>
<td class="org-right">36.73</td>
<td class="org-right">102.26</td>
<td class="org-right">134.69</td>
<td class="org-right">111.35</td>
</tr>

<tr>
<td class="org-left">Trondheim</td>
<td class="org-left">Norway</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">NOK</td>
<td class="org-right">78.10</td>
<td class="org-right">41.60</td>
<td class="org-right">102.06</td>
<td class="org-right">118.57</td>
<td class="org-right">98.92</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Denis Davidoglu</p>
<p class="date">Created: 2023-10-22 Sun 15:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>